/**
 * Created by Dade on 2016/12/25.
 */
package com.dade;

/**
 *
 * 题目：房屋出租出售网站设计与实现
 *
 * 分析：房地产中介
 *
 * 可以参考的网站 : 家家顺 链家 中原 房多多 爱屋吉屋
 *
 * 链家名词解释
 *
 * 旅居地产
 *      链家旅居是链家集团旗下品牌，依托链家房产O2O平台优势资源，开创全新的集地产营销、房屋资管和旅居服务为一体的旅居
 * 综合服务模式，打造旅居生活新入口，提供一站式旅居服务。
 *
 * 旅居
 *      近年来国内有一批老年人和有闲阶层，冬去南方，夏到北国，每年选一个新地方“安”一个新家，一住就是几个月，避寒避暑，
 * 颐养人生。人们把这种鸟雀似的迁徙生活方式，称之为旅居；这批“春鸿秋燕”也被大家尊之为“候鸟人”，简称“鸟人”。
 *
 * 架构分析
 *
 * user
 *      agent   经纪人
 *      hunter  普通用户，可以买房 买房 租房
 *
 * house
 *      房屋信息
 *
 * basic
 *      基本类
 *
 * commons
 *      公共类
 *
 * test
 *      测试包
 *
 */